# running in alu/src/
read -formal alu_formal.sv
read -formal ALU.sv
prep -top alu_formal

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
